export default {
  head: 'Добро пожаловать!',
  text:
    '<p>Данное задание является продуктом совместной разработки в рамках финального задания в обучении на курсе React 2022 Q1 школы The Rolling Scopes - бесплатной программы образования, организованной сообществом разработчиков Rolling Scopes Developer.' +
    '</p><p>Задание является своеобразным закреплением «пройденного материала», требует применения знаний и умений, полученных на предыдущих 6 тасках, плюс развивает навык командной работы.' +
    '</p><p>Результатом разработки должно явиться приложение, помогающее достичь поставленные задачи отдельному человеку в команде или группе разработчиков - Система управления проектами.' +
    '</p><h2>Над проектом работала команда:</h2>' +
    '<ul><li><a href="https://github.com/iamserik" target="_blank" rel="noreferrer">Naviy Serikzhan <a>' +
    '</li><li><a href="https://github.com/choco-cat" target="_blank" rel="noreferrer">Natallia Panfilenka</a>' +
    '</li><li><a href="https://github.com/arteemm" target="_blank" rel="noreferrer">Artsiom Mianitski</a>' +
    '</li></ul>' +
    '<p>' +
    'Итак, для работы с&nbsp;проектами и управления ими нужна авторизация. Предусмотрена также регистрация пользователя.' +
    '</p>' +
    '<p>' +
    'Авторизованный пользователь может ставить задачи, выполнять задачи, просматривать задачи, удалять собственные задачи, быть ответственным в чужих задачах.' +
    '</p>' +
    '<p>' +
    'После авторизации пользователя перенаправляет на страницу управления проектами. Там можно создать новый проект либо принять участие в уже созданных. Каждый проект представляет собой доску, на которую помещаются карточки-задания. Последние группируются в колонки, которые иллюстрируют некий статус карточки-задания. Например, может могут быть колонки: Нужно сделать, В процессе, Сделано.<br>' +
    'Карточка содержит текст задания и может быть назначена на выполнение определенному пользователю. Перетаскиванием мыши пользователь может менять местами колонки, очередность заданий в рамках колонки, принадлежность задания к колонке.' +
    '</p>' +
    '<p>' +
    'Для создания задачи должна уже быть создана хотя бы одна колонка. Задача принадлежит колонке. При удалении колонки удаляются все задачи в ней.' +
    '</p>' +
    '<p>' +
    'Также пользователю доступна форма для редактирования профиля, где он может изменить свой пароль, имя и логин.' +
    '</p>',
};
